{
    "content" : "<p>Long time ago, this place is called Hinayaan which is a Visayan term meaning &ldquo;a place of dead&rdquo;.&nbsp; It started with an incident happened between two folks having a quarrel that unexpectedly leads to a brutal death of one person involved.&nbsp; The dead body lay on the ground near the river for the whole night, and is recovered the next morning.&nbsp; For so many instances, this brutal incident happened.&nbsp; In 1910, provincial Governor Eugenio Jaro declared and approved the name Barrio Hinayaan as its identity. &nbsp;It consists of two sitios name Maanso (now Sta. Rita) and Golgota (now Tambis).&nbsp; There were very few people who lived on this place.&nbsp; Barrio Hinayaan originally has 60 households with no formal education for the residents.&nbsp; This place was a big forest and located at 12 kilometers&nbsp; away from the town of Hilongos.&nbsp; Only horses were used as a way of transportation for there was no other accessible means of going to nearby places.&nbsp; There were also no school and chapel at this time.</p><p>It was believed that there were only five families who first came on this place.&nbsp; These were Bayo, Miraflor, Beltran, Abunda and Fortaliza families.&nbsp; At that time, Graciano Bayo was the head or Teniente del Barrio.&nbsp; In 1991 Eustaquio Bohol became the Teniente del Barrio.</p><p>Years passed, Maestro Luis Floro has changed its name Hinayaan into Bagumbayan, a name derived from place where Dr. Jose P. Rizal died since the name Hinayaan itself sounded not good to hear.&nbsp; Late Graciano Bayo has donated a piece of land across the creek and a piece of land for the installation of a chapel.&nbsp;&nbsp; He was one of the &ldquo;Ginhaupan&rdquo; known as Kagawads nowadays.</p><p>Barangay Bagumbayan was headed by different leaders like Eustaquio Bohol, Sergio Pole, Basilio Robusa, Candido Miraflor, Agapito Zamora and Floro Beltran.&nbsp; They were entitled as Teniente del Barrio.&nbsp; Moreover, Evaristo Napoles, Anatalino Fortaliza, Policarpio Matas, Hilario Morales, Casiano Miraflor, Alfredo Abunda, Autiquio Miraflor, Pedro Zamora, Marcelino Fulache and Francisco Mantahinay were Segundo Teniente del Barrio of the barangay.</p><p>The population of Barangay Bagumbayan outgrew after the war.&nbsp; Teniente del Barrio, Floro Beltran declared to have a Barrio Fiesta but failed to consult his councilmen.&nbsp; Because of this misunderstanding, some of his council transferred to nearby barangays like Pablo Abunda and Martin Zamora&nbsp; of sitio Maanso goes to STa. Rita and Quirino Lina to Barangay Tambis.</p><p>In 1944, some parts of land owned of this were discovered to be a legal property of the nearby Barangay Baas.&nbsp; And so, the total land territory of barangay is decreased.</p><p>In 1957, roads and bridges were built in Pangi.&nbsp; Engr. Jacain constructed the reservoir of drinking water.</p><p>In 1958, Mr. Ortega of PACD made the artesian well in the barangay poblacion.</p><p>In 1959, more roads were built through the effort of Teniente Floro Beltran.&nbsp; More years after Teniente del Barrio, Hilario Morales headed the construction of the Barangay Chapel (150 sq.meters)</p><p>In 1960 the school Grade 1 to VI was built.&nbsp; And now, the population of this barangay is increasing with a competing quality of education.</p>"
}