{
    "content":"<p><strong>Location :</strong></p><p>This Barangay lies in the northwestern part of the municipality of Hilongos.&nbsp; It I surrounded by the following barangays:&nbsp; Katipunana and Kapudlusan to the north; Maasin of Hindang to the west; Pa-a &amp; Sto. Ni&ntilde;o to northeast; Protection &amp; Bagong Lipunan to the south &amp; Sta. Cruz to the southeast.</p><p><strong>Early Settlers :</strong></p><p>The early settlers of this Barangay were migrants from the southern islands; Bohol, Mindanao &amp; Cebu.&nbsp; These early settlers originally made their temporary homes on the northern portion of this Barangay particularly in these heavily forested and hilly areas of Hinlawin-an and Malbog, the original barrio settled by early Visayan settlers.</p><p><strong>Occupation :</strong></p><p>The early Bung-awanons engaged chiefly in hunting and river fishing.&nbsp; They supplemented their daily needs with wild fruits and rootcrops.</p><p><strong>Spanish- Philippine Revolutionary Period :</strong></p><p>After the conquest of Cebu by the Spanish Augustinian and Franciscans missionaries arrived in Hilongos, the first Spanish exploring parties came to this place.&nbsp; Asked by the Spaniards about the name of their village (in Spanish) some natives pointed to their houses built on Hinlawin- and hills a hilly part that overlooked the once steep precipice of the Tagbauto River and they replied &ldquo;Bung-aw&rdquo;.&nbsp; The name &ldquo;Bung-aw&rdquo; was recorded in the Spanish archives, hence it remains to this day the official name of the Barangay.</p><p><strong>American Period and the Commonwealth Years :</strong></p><p>The newly established civil government of the Philippine made Bung-aw a distinct political unit- the barrio official (particularly the teniente del barrio) were appointed by the district municipal councilors.&nbsp; There was no unified barrio fiesta celebration, for the people were divided by their religious practices.&nbsp; It was not until the end of the First World War that there were religiously united to celebrate their annual&nbsp; fiesta on March 5.</p><p>Accession of appointed barrio teniente worked for the opening of the public school.&nbsp; The first barrio school was opened sometime in the early nineteen twenties, with 2 teachers assigned to the primary grades.</p><p>The barrio first acquired a permanent school site, donated by the Redolosa family.</p><p>During the Japanese occupation, the school was closed, but was later reopened and Niponggo (Japanese language) was taught.&nbsp; Later the guerilla government took over, and regular classes were conducted.</p><p>In 1946 (October 16) the present intermediate course was opened (grade five class).&nbsp; Its first graduation exercises were held in April on the date of the late Pres. Roxas.</p><p>The present secondary school (Barangay High in March 1975).</p><p>Bung-aw was once claimed by the municipality of Hindang, but the dispute was favorably settled in favor of Hilongos</p>"
    
}