{
    "content":"<p>As the name itself implies Central Barangay, Poblacion of this historic and century-old municipality of Hilongos, Leyte is strategically located in the center or heart of the town Poblacion between the other two Poblacion barangays namely Eastern Barangay and Western Barangay.</p><p>It is concededly the most highly urbanized commercial barangay bustling with people coming from all walks of life fairly distributed among its growing professionals, landowners, businessmen, government employees and students including transient foreign missionaries and visitors down to the lowest paid laborer in its labor sector.</p><p>It boosts of 1,290 registered voters based on the 1988 local elections.&nbsp; Furthermore, this town&rsquo;s premier Barangay has a total land area of 70.1620 has. With a total population estimated at 2,398 inhabitants as of 1990 who were lured to settle down there peacefully with their loved ones.</p><p>Still an infant barangay created around 1975 by virtue of a Presidential Decree No. 86 during the Martial Law days, Central Barangay, Poblacion enjoys the sole distinction as the biggest commercial Barangay where the Hilongos Public Market is presently located.&nbsp; The old market was razed to the ground in one of the worst conflagration which hit Hilongos on that unforgettable Holy Thursday night of April 18, 1984.</p><p>Indeed, a Barangay of firsts, it is the only Barangay hereabout with a dozen former mayor combined comparable in a smaller decree to the state of Virginia, USA, the State of Mother of Presidents.</p><p>Among them were the following:</p><ol><li>Francisco Flordelis&nbsp; -&nbsp; &nbsp;1900 &ndash; 1903 &nbsp;(appointed)</li><li>Dionesio Vilbar -&nbsp; &nbsp; (appointed)</li><li>Brigido Rivera -&nbsp; &nbsp; 1907 &ndash; 1910 &nbsp;(elected)</li><li>Canuto Alcuino -&nbsp; &nbsp;1913 &ndash; 1917&nbsp; (elected)</li><li>Avelino Rubio -&nbsp; &nbsp; &nbsp;1926 &ndash; 1931&nbsp; (elected)</li><li>Melquiades Flores -&nbsp;&nbsp;&nbsp;1939 &ndash; 1947&nbsp; (elected)</li><li>Romanico Ruiz -&nbsp; &nbsp;1942 &ndash; 1944&nbsp; (Japanese Occupation)</li><li>Emiliano J. Melgazo -&nbsp; &nbsp;1948 &ndash; 1957&nbsp; (elected)</li><li>Marcial Cubio -&nbsp; 1970 &ndash; 1978&nbsp; (elected)</li><li>Manuel M. Melgazo - 1980 &ndash; 1986&nbsp; (elected- March)</li><li>Harry A. Viterbo - 1986 &ndash; 1987&nbsp; (OIC- November)</li><li>Rodolfo F. Mendoza - 1987 &ndash; 1988&nbsp; (Caretaker- January)</li></ol><p>It has her share of war-time heroes and distinguished sons notably the lae Kapitan Francisco &ldquo;Kikoy&rdquo; Flordelis the first gobernadorcillo, the late fighting mayor Romanico P. Ruiz, during the Japanese occupation, Hilongos first Assemblyman the late Emiliano J. Melgazo of Region VIII, late Archbishop Most Rev. Cipriano V. Urgel of the Archdiocese of Calbayog and Palo, former mayor Manuel M. Melgazo, District Governor, Kiwanis South, Kiwanis International and the promising late Atty. Manuel Lora, a UP product who was killed by the dreaded Japanese Kempetai in Cebu City together with Cebu&rsquo;s Ni&ntilde;o Bonito the late Governor Dodong Avellana and the late Assemblyman Paulino Gullas a distinguished Bar Topnotcher and legal practitioner whose deaths were deeply shrouded in mystery.</p><p>Central Barangay celebrated its first Barangay fiesta on September 28-29, 1989 in honor of Siant Lorenzo Ruiz, the first Filipino saint.&nbsp; It was the last Barangay of the 51 Hilongos barangays to celebrate her first fiesta to date under the leadership of Barangay Captain Alfredo M. Suarez.</p><p><em>First appointed Barangay Officials were:</em></p><p>Barangay Captain&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;-&nbsp; &nbsp; &nbsp;Romualdo L. Macuto</p><p>Secretary&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;-&nbsp; &nbsp; &nbsp;Bonifacio F. Villahermosa</p><p>Treasurer&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;-&nbsp; &nbsp; &nbsp;Enrique A. Carillo</p><p>Councilmen:</p><ol><li>Rogelio Villahermosa</li><li>Cerilo V. Barbusa</li><li>Reynaldo P. Zapata</li><li>Switberto F. Ocampo</li><li>Lamberto M. Flanco</li><li>Eterio P. Rubilllos</li></ol><p>&nbsp;</p><p><em>First Elected Barangay Officials:</em></p><p>&nbsp;</p><p>Barangay Captain&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; -&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Fernando Tantuan, Jr.</p><p>Secretary&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; -&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Salvador L. Alcuino (appointed)</p><p>Treasurer&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; -&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Romualdo L. Macuto (appointed)</p><p>Councilmen:</p><ol><li>Lamberto M. Flanco</li><li>Teodoro U. Robles</li><li>Elias Bohol</li><li>Alfonso Grafe (deceased)</li><li>Alfredo B. Ardiente</li><li>Bonifacio F. Villahermosa</li></ol><p>KB Chairman&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Jacquiline Tantuan</p><p>The incumbent Barangay Chairman Alfredo M. Suarez is the first elected ABC President from Central Barangay, Poblacion shortly after the barangay elections.</p><p>In final retrospect, Vice-Mayor Francisco F. Pil and Municipal Councilors Cristuto F. Ong, Salvador L. Alcuino, and Alfredo B. Ardiente are all respectable residents of this unique history- rich Barangay.</p>"
    
}