{
    "content":"<p>Barangay Concepcion an interior Barangay of the municipality of Hilongos, Leyte is about six (6) kilometers east of the Poblacion.&nbsp; It is located at a strategic center of the upper barangays.&nbsp; It is connected to the Poblacion by the proposed provincial road to Mahaplag and Abuyog on the eastern side of the island of Leyte.&nbsp; At present the construction of the interior portion leading to Mahaplag is stopped due to the change of administration.&nbsp; The passable road is only up to Barangay Cacao about 12 kilometers from Concepcion.</p><p>If we are to trace the beginning of Concepcion, we could not find exact and permanent record to refer from.&nbsp; This account is taken from the stories of our old folks and from our grandparents.&nbsp; In the early years the people of Concepcion were not concentrated in a place to be called a barangay.&nbsp; Houses were scattered because most of the land owners build their houses at the side of their to the town.&nbsp; The people who were living further in the hinterlands passed through the riverbed locally called &ldquo;Lagnason&rdquo; when they go to the Poblacion.&nbsp; During rainy days when the flood covers the riverbed, they could be forced to pass the muddy path to the town.&nbsp; Cargoes of abaca and other products to town were transport by carabao sleds and on horsebacks.&nbsp; These animals made the paths so muddy.</p><p>When the Philippines were ceded to the Americans by the Spanish government in 1898 the Americans took position of the archipelago.&nbsp; American soldiers were sent to the different islands of the country to make friends with the people, and to impose the American Military rule in our country.&nbsp; When the Americans came to Hilongos, they met resistance because the leader Capitan Kikoy Flordelis had organized a guerilla to encounter the American</p><p>In Bag-ong Lungsod, at present Concepcion a trenchera was constructed on top of the hill just overlooking what is now Purok 4, because this is the principal passage to Sta. Margarita and other upper barangays to the Poblacion.&nbsp; The trenchera was made out of soil piled similar to a wall 4 feet high just enough for the soldiers to look down the road below.&nbsp; They mounted a wooden canon a top the trenchera.&nbsp; When the American soldiers passed in their way to Sta. Margarita they saw the constructed wall on top of the hill.&nbsp; During that time the guerilla soldiers were not yet in camped.&nbsp; They didn&rsquo;t know that the American soldiers would go to the upper barrios so soon. On that very morning when they passed and saw the trenchera, they fired a shot and posed a while to wait for any movement from the guerilla soldiers.&nbsp; There was not a sound so they fired continuously without stopping for about half an hour, according to the old folks who were frightened on what had happened, the shots sounded like pop corn crackling.</p><p>All the inhabitants of Bag-ong Lungsod had jumped out of their houses and run to the wooded places in the outskirt of the barrio.&nbsp; They didn&rsquo;t know that the American soldiers will arrive that day.&nbsp; Because there was no retaliation, the American soldiers marched up to the hill and tried to see the trenchera.&nbsp; They found cooking utensils and big vat they called &ldquo;cawa&rdquo; for cooking rice, and plates, but there was no soldier found where.</p><p>The Americans broke the &ldquo;cawa&rdquo; and throw all the things inside the trenchera and out and proceeded to Sta. Margarita.&nbsp; At 3:00 o&rsquo;clock p.m. that day the Americans retuned to town but they went around Bag-ong Lungsod and burned all the houses big and small.&nbsp; Some of the people, who were able to reach the hills of Paa and Seguinon, saw barrio in flames and smoke.&nbsp; So the people who had jumped out of their houses in the morning who had not brought anything from their houses, had nothing left when they went home.&nbsp; The saw only ashes and some people just picked up the porcelain plates that were not burned.</p><p>In 1936 the American Division Superintendent of Schools visited Bag-ong Lungsod Primary School.&nbsp; His name was Mr. Bobcock.&nbsp; He observed the class.&nbsp; The teacher, Miss Payang Lecito handling Grades II, together with the children and I were quite nervous because of his queer look.&nbsp; That was the first time they saw an American which look so different from our people.&nbsp; After observing the class we went to the barrio teniente that time Mr. Gil Lozada and Segundo Teniente Cornelio Pilpil.&nbsp; The Superintendent together with the teniente tried to locate the stone boundaries at the four corners of the school site, the donated land.&nbsp; Seeing that the houses were built inside the site, he ordered the teniente to manage the transfer and uprooting of all the houses built within the site. &nbsp;He gave them only two months to dor the works.&nbsp; The works was done by &ldquo;tagbo&rdquo; or forced labor.&nbsp; Nobody could stop them.&nbsp; The people concerned would only murmur, angry and sad commentaries.&nbsp; That is why until now houses are only seen on one side of the street in Concepcion.&nbsp; In 1938 these streets were labeled.&nbsp; The street straight from the Poblacion&nbsp; to Makinhas is Inocentes Villaflor Street in honor of his effort to complete the road to the Pobalcion being the President.&nbsp; The street from Mr. Perfecto Lor&rsquo;s house down to Paa is Melquiades Flores St. because in this term as Mayor he managed to open the road to Brgy. Paa. The street from Pitong Velmonte&rsquo;s house to the Chapel is Marcelo Fulache Street to construct the irrigation system of Concepcion, the irrigation Canal we have now.&nbsp; The street from the chapel toward the houses of Mr. Moises Torrente is Felipe Lor St. giving him honor as a ginhaupan for a long time and being donor of the barrio site.</p><p>At about 1880 two families of this locality, a certain Mamerto Lagaso and Felipe Lor had a dispute on the ownership of a four hectare lot which was not resolved for a period of time. The case was elevated to the town Mayor which before called Capitan for settlement.&nbsp; This time the town head was Capitan Francisco Flordelis popularity called Capitan Kikoy.&nbsp; The&nbsp; Capitan delegated the parish priest, at that time Fr. Lucas Sanchez to settle the case amicably.&nbsp; The parish was able to convince the two families to donate the said land to be a barrio site.&nbsp; Sto it was Fr. Lucas who supervised the construction of the streets around the 4 hectares square lot that was made into barrio streets that we can see at present.&nbsp; The parish priest called the new settlement &rdquo;Bag-ong Lungsod&rdquo; because he said in the near future this will become a new municipality of town.&nbsp; The families in the nearby places were encourage to build their houses at the streets.&nbsp;&nbsp; Not so long after that, the barrio was populated.&nbsp; The town Capitan ordered the barrio people to keep the barrio streets &nbsp;&nbsp;always clean.&nbsp; Every week, every person sets a day for communal work to clean the streets with the use of bolo &ldquo;gona&rdquo; as they called it.&nbsp; Those people who are caught uncooperatively were brought to the Poblacion and put in prison in the &ldquo;Case Real&rdquo;; new our town hall, and made to clean the Poblacion street daily until he finished his term of prison.&nbsp; With these drastic orders, the town streets and the streets of the new community &ldquo;Bag-ong Lungsod were always clean and uniformly fenced on both sides.&nbsp; The two streets cleaning was made possible because every citizen of the town has a day every week to help in town cleaning, they call this &ldquo;Semanahon&rdquo;.&nbsp; The barrio head &ldquo;Ginhaupan&rdquo; during this period was ginhaupan was quite corrupt.&nbsp; When the day comes for his people to work in the town for their &ldquo;semanahon&rdquo; he will select about 8 to 10 persons to work in his farm instead of going to town to work on the town streets.</p><p>In 1936 when there were already many barrios created, the municipal mayor Melquiades Flores ordered registration of the difference barrios.&nbsp; Other barrios used&nbsp; the name of their Patron Saint to name their barrio for registration.&nbsp; That was happened to Concepcion.&nbsp; The teniente looking at the posing of the Virgin Mary thought that our Patron Saint was Immaculate Concepcion because it has a similarity to the Patron Saint of Hilongos Immaculada Concepcion.&nbsp; So the registered name was Concepcion, only to find out that the Patron Saint of this barrio is the Asumption of our Lady or Asuncion.</p><p>In 1938 when the road to the Poblacion was completed the transportation facility was the tartanilla, a horse drown careteala.&nbsp; These tartanilla would standby at the riverbank now Purok 4 where they will wait for passengers to town.&nbsp; Purok 4 became the business center of Conception and it was a fast growing community.&nbsp; A certain couple who lived there, who had come from Makinhas, Baybay, Leyte saw that the situation of this new community was similar to Makinhas, Baybay.&nbsp; They suggested naming their new place Makinhas.&nbsp; All the people living there agreed, so they proudly called this place Makinhas.&nbsp; Because business was going on especially during World War II Makinhas became popular even to the different municipalities.&nbsp; People from all other places call the barrio Makinhas.&nbsp; Makinhas in the real sense that&nbsp; it is only Purok 4 of Concepcion.&nbsp; There was cockpit building in Makinhas, which drew the cockfight lovers to assembly, these every Saturday, which also become lovers to day, it became popular and also a day of buying and selling.&nbsp; Difference things are old there during Market Day.&nbsp; Farm products from the people of the upper barangays are displayed aside from dry goods, groceries, fish products and almost all commodities we need are sold.&nbsp; So to say this is a center of business.&nbsp; In 1951 the super typhoon Ami brought about a great destruction of the place aside from the very strong winds, a great flood that almost covered all the plains of Hilongos wiped out about 80 houses in the said&nbsp; Makinhas.&nbsp; Destruction of property was great.&nbsp; Because they had seek refuge to higher places, only one child died during this flood in Makinhas, although hundreds of people died from barangays and several people missing.</p><p>In 1952 the Gallery association revived their cockfight business. They bought a hectare lot from a certain Akyam Yan, where they constructed again a cockpit building at the center of the lot. They divided the sides to lots for every member of the association.&nbsp; The Saturday Market Day has been going on even until now.&nbsp; Because the center of business before was Makinhas, then at this new market side people still continue to call it Makinhas, although it is near the school zone.</p><p>&nbsp;</p><p>The sad thing about this market is that, it&rsquo;s not a barrio market, but a private market owned by the Gallera Association, which they call themselves, Concepcion Progressive Association (CPA).&nbsp; There had been a move by the brgy. officials before, to change this to a Barangay market so that it will be a source of Barangay income, but until now it was not realized.&nbsp; Sooner or later our Barangay officials will find a way to change this into a Barangay market.</p>"
    
}