{
    "content":"<p>As a unit of government, the Barangay antedated the Spanish conquest of the Philippines. The word &ldquo;Barangay&rdquo; is derived from the Malay &ldquo;balangay&rdquo; a boat which transported the malay migrants to these shores.&nbsp; The Barangay was ruled by a dato who exercised absolute powers of government.&nbsp; While the Spaniards kept the Barangay as the basic structure of government, they stripped the dato or rajah, of his powers.&nbsp; Instead, power was centralized nationally in the governor general and locally in the encomiendero and later, in the alcalde mayor and the gobernadorcillo.&nbsp; The dato or rajah was much later renamed cabeza de Barangay, who was elected by the local citizens possessing property, the local Principalia.&nbsp; The position degenerated from a title of honor to that of a mere government employee.&nbsp; The cabeza exercises leadership over his Barangay and collected taxes or tributes from its residents for the Spanish Crown.&nbsp; The barangays became barrios and components of Spanish pueblos, townships, even prior to the arrival of the Americans.</p><p>For some time, the laws governing barrio governments were found in the Revised Administrative Code of 1916 and later in the Revised Administrative Code of 1917.&nbsp; Barrios were granted autonomy by the original Barrio Charter and formally recognized as quasi-municipal corporations by the Revised Barrio Charter.&nbsp; During the martial law regime, barrios were declared or renamed &ldquo;barangays&rdquo;- a reversion really to their pre-Spanish names, but their basic organization and functions which was expressly adopted as the Barangay Charter, were retained.&nbsp; However, the title of the officials were changed to barangay captain, barangay councilman, barangay secretary, and barangay treasurer.&nbsp; To broaden the authority of the people as primary ruling authority of the nation President Marcos issued a decree providing greater participation in the citizens&rsquo; assembly a) age limit reduced to 15 years of age to empower the youth in the government; b)&nbsp; assembly may be called up and convened directly by the peoples&rsquo; initiative through pRogeliotion of one-tenth (1/10) of its members; c) a quorum requires only one-fifth (1/5) of total members of citizens&rsquo; assembly to carry out its business.&nbsp; This concept of Citizen&rsquo;s Assembly continues in what is now Barangay Assembly under the local code with the same age limit of 15 years or older for its membership.</p><p>Hilongos town proper was not called a barrio, the latter concept only applied to outskirts of municipality for many years.&nbsp; The town proper, name Poblacion, was not understood in the concept of barrio, rather it is understood to be the seat of the town&rsquo;s government, a ward or district under the direct administration by the municipal mayor.&nbsp; In 1973 the municipal council passed a resolution dividing the poblacion territory into three separate barangays, namely&rdquo; Eastern Poblacion, Central Poblacion and Western Poblacion, and forthwith the municipal mayor appointed barangay captains with a set of councilmen pursuant to the law.</p><p>Barangay Eastern Poblacion inherited the eastern portions of what was the district of Poblacion or town proper.&nbsp; The first Barangay captain was Hon. Alfredo Villaruel, his honorable council members were Vic Flanco, Amado Ocampo, Ismael Nevado, Filomino Yap, Fermin Yap, Loloy Caalim and Berting Arbilon.&nbsp; Tanod brigade was also created by Capt. Villaruel, immediately it was through this tanods that a thief was caught within the Go Construction vicinity of salog bridge, and was prosecuted in courts, earning laudable achievement to the newly formed barangay administration.&nbsp; It was Hon. Villaruel who initiated the opening of San Juan Street connecting the national road to Calle San Isidro.&nbsp; However, Hon. Villaruel was to immigrate to the United States, so he tendered his formal resignation to the Mayor, who then appointed Hon. Rogelio Yan to finish the term.</p><p>Election came and the incumbent appointee Hon. Rogelio Yan was elected into the position as barangay captain of Eastern Poblacion.&nbsp; Hon. Yan&rsquo;s administration was very long, he was clearly a favorite leader of the people for he was re-elected three times into this position, and he presided sets of duly constituted councils or sanggunians- he succeeded to preside the first council of Hon. Villaruel and another three elected or appointed councils in his own tenure.&nbsp; He was able introduce more improvements on several aspects of development.&nbsp; The SK was organized and constituted, functional barangay health center was established; he erected the gymnasium; tanod brigade was strengthened and underwent training and barangay justice system has conducted mediatory sessions to benefit the litigant parties.&nbsp; Moreover, Eastern Poblacion had the pride of having their captain sit in the municipal council as ABC President throughout the tenure of Hon. Yan.&nbsp; An achievement deserving the person of the captain.&nbsp; Through public fund he bought the barangay lot which today put into place by an ordinance of a site plan.</p><p>On May&nbsp; 2002, the barangay elections however turned the tide against Hon. Yan.&nbsp; Challenger candidate Hon. Oscar Villaflor came &nbsp;&nbsp;from no less prominent family of leaders in Hilongos, a son of the former popular mayor Hon. Inocentes Villaflor and a brother to the then incumbent mayor Hon. Altagracia Villaflor.&nbsp; It was no mean contest.&nbsp; Only a miracle could have saved Mano Eti&rsquo;s submit for re-election.</p><p>Hon. Oscar Villaflor won by a large margin.&nbsp; He ruled the barangay with his newly elected councilmen, the fifth Sangguniang Barangay. During his term the people saw a down-to-earth policy, honest, determined, noble and brave.&nbsp; Hon. Oscar Villaflor successfully opened up the remaining unimplemented length of San Lucas Street in the face of oppositions above below the local principalia; he improved sanitation and drainage system; and improved nutrition and health services in barangay level.&nbsp; He opened up the dikesides for selective settlement of Barangay Eastern squatters benefitting hundreds of homeless souls; profuse in his charity to the poor, and notably very efficient in management&mdash;he is the only chief executive frequently seen busily walking along barangay streets visiting sitios and neighborhoods discussing welfare matters with the people, and making sure that whatever good things come to the plan must come to reality.&nbsp; His exceptional foresight is evident from the elevation and design of the barangay hall which he built out of limited resources; a design offering comfortable ambiance and safe from the frequent floods.</p><p>However, the people was technically deprived a longer service from Hon. Oscar Villaflor. &nbsp;Roseller Yan, a son of former barangay captain filed a case in the court praying to disqualify Hon. Villaflor from public office on account of latter&rsquo;s dual citizenship&mdash;Oscar Villaflor was also a US citizen.&nbsp; The court ruled against the incumbent captain, and he was disqualified.&nbsp; Hon. Oscar Villaflor died on his birthday Feb. 3, 2014.&nbsp; The poor sector was moved of his demise, and many of the indigent constituents asked council members to do something in honor to the beloved leader, just to name a street in his honor.&nbsp; The council convened in an emergency session that day and passed Resolution No. 14020301 requesting the Sangguniang Bayan to name the existing road extending from west to east boundaries of the dike area into Capt. Oscar R. Villaflor St. (CORVIS).&nbsp; Had this man completed his term of office he would have delivered greater things that what people saw in a short time.</p><p>Hon. Oscar Villaflor was succeeded by his first Kagawad Hon. Samuel Rubillos.&nbsp; Friendly, handsome and tall, the smiling-boy Hon. Rubillos began to serve the remaining term to the best of his abilities by continuing the usual services his predecessor began.&nbsp; However, Hon. Rubillos met some health problems and was forced to delegate his office to Hon. Rebecca Rio, next to him in the rank.&nbsp; Since there is no provision in the local code respecting &nbsp;exceptional or unusual series of successions to the position of captain, the third successor Hon. Rebecca Rio was rather given the descriptive title of Officer-in-Charge, but in all things she was the Chief Executive and all powers vested in the punong barangay by all existing laws were in her hands.</p><p>Hon. Rebecca &ldquo;Bec&rdquo; Restor-Rio, a professional retired public school teacher and dedicated to her office continued and finished the remaining tern of Hon. Oscar Villaflor.&nbsp; Known for her commitment to public office she was the first captain to take daily duties in the Barangay hall with her officers, without noon break.&nbsp; Through her example the women volunteers BHWs, BNS, BSPO and DCW were inspired to do more in their respective duties and became efficient in their works.&nbsp; She turned what an average looking Barangay hall into a dignified official work place.&nbsp; She taught the volunteers the best standards in each work and maintained almost perfect record keeping.&nbsp; She was an excellent public administrator that goaded everyone into the proper place to do the right thing the best way.&nbsp; Under her administration Brgy. Eastern fared high during evaluations.&nbsp; In her tenure Brgy. Eastern began to hold annual fiesta every May 1 in honor to St. Joseph the Carpenter.</p><p>Elections came and leadership was vied between new candidates, Mario Marte and Eduardo Nevado.&nbsp; By a slim margin Marte won and with the new council elects they were inducted to their office.</p><p>Hon. Mario V. Marte is a son of an educator mother and a nephew to the former mayor the late Hon. Reynaldo Villaflores.&nbsp; Came from a prominent and well-to-do family, handsome and domineering Hon. Marte commands the support from his subordinate and the people as well.&nbsp; He had a long tenure by being re-elected once back to office and be able to preside two council, the 6<sup>th</sup> and the 7<sup>th</sup>&nbsp; Sangguniang Barangay.&nbsp; During his term he was able to erect the daycare building housing the children on class sessions; built the nursery and stock rooms; began fencing the perimeter lot; cleared the drainage system during rainy days; submitted some scholarship to deserving youths and altered once the date of fiesta; and a drainage canal within the vicinity of greenview.</p><p>His second term in the re-election was peculiar.&nbsp; With most of his candidates for kagawads losing the bid to opponent ticket and two other new corner independent candidates it meant he had to preside a divided multi-party council.&nbsp; His council this time includes new unfamiliar faces in the Barangay politics.&nbsp; These sat in the 7<sup>th</sup> Sangguniang Barangay: Cecilio Collen Perez (independent, new), Rufo Flanco, Rolly Yan, Edilberto Velos, Milagros Fidel (op. new) Naciancino Palo (independent, new), Ben Drazen Urgel (op.) and the SK Chairman Jona Jean Flanco (new).</p><p>Probably from an unbecoming advice the council broke into a fiery dissension only one month after their constitution.&nbsp; In conspiracy and prodding by the treasurer Mr. Cristopher Tapayan, the tanod brigade held secret meetings and signed petition to oust Hon. Cecilio Collen S. Perez from chairmanship of committee on peace and order and moved Hon. Rolly Yan to replace.&nbsp; Hon. Perez called a meeting with the tanod brigade; but the seditious ones stood with the chief tanod Rogelio Vilbar by the roadside and prevented other tanods from attending the meeting as called by the chairman.&nbsp; The affected chairman on peace and order learned that the punong barangay prevented one tanod too (Jaime Niniez) from attending the meeting and to take the side of the chief tanod Roging Vilbar, and in fact the conspiracy with other councilors, the treasurer and the senior tanods has the blessing from Marte.&nbsp; In retaliation Hon. Perez, in the session that followed, passed motion to expel Rogelio Vilbar and Dodong Lombog from the brigade, threatening to file a case of sedition (Sec. 139 (2) RA3815) against the signatories should the expulsion resolution is not accommodated. Five sympathy votes in the council passed approve the resolution, versus two in Capt. Marte&rsquo;s side.&nbsp; But Hon. Marte thereafter talked to Hon. Perez and pleaded in favor of Vilbar and Lombog.&nbsp; Hon. Perez being courteous and to avoid further embarrassment to the captain agreed kept the peace and withdrew the resolution.&nbsp; Throughout the entire tenure of the 7<sup>th</sup> sanggunian this event has created and indelible scar as much as incurable division among the officials in the council.</p><p>The birth of KM-6.&nbsp; That conspiracy taught an important lesson to the council, and for those in the good side taught them to be vigilant all the more.&nbsp; Members coming from opposing tickets and the independents form into an alliance out of desire to stand for good government.&nbsp; What came out was a block of majority in the council &ndash;Perez, Flanco, Fidel, Palo, Urgel and Jonajean (SK), an alliance of six (6) votes within the sangguniang, they now call their alliance as Councilors of the Mass (Kagawad ng Masa-6, or KM6).</p><p>Commanding majority votes the KM-6 achieved its aim characterized by principle of transparency and good government.&nbsp; The most important of these achievements was the protection of the public fund from being wasted away through unconscionable appropriations; any proposal of expenditure that didn&rsquo;t qualify as an inevitable necessity it was disallowed by objection from the floor.&nbsp; This watchdog procedure worked many time.&nbsp; But it once back fired.&nbsp; The mayor Hon. Roble summoned the captains to a GAD seminar to be held in Metro Manila.&nbsp; The travel order calling for a budget of P16,000 was presented by Hon. Marte in a session.&nbsp; The KM-6 was not convinced and found the travel extravagant, unnecessary and unconscionable; arguing categorically that a GAD learning needs only a simple input material that may cost P100 if a handout is sold and bought, or that a seminar of this subject can be given by any one from DILG in the locality through the forum amounting only to cost of one lunch, but to travel to Manila for that purpose is totally extravagant and excessive; so the KM-6 ruled against the travel.&nbsp; However Hon. Marte flew to Manila at his own expense.&nbsp; Returning there from he filed a case against the council chairman on finance and appropriations Hon. Naciancino Palo for not signing the voucher.&nbsp; It was only few days passed that Hon. Palo had a real stroke on hypertension and now facing a headache litigation.&nbsp; The KM-6 strengthened Hon. Palo and assured him that case against him shall not prosper.&nbsp; DILG directed the captain to file the initiatory complaint in the Sangguniang Bayan with the court in view.&nbsp; Hearing came. Case was dismissed.&nbsp; In another instance, about December 2012 the captain summoned for a special session, a council member moved for a productivity enhancement incentive in the gigantic amount of P240,000.&nbsp; Again, the KM-6 found this unconscionable.&nbsp; Disallowed.</p><p>Through the alliance of KM-6 the 7<sup>th</sup> sangguniang barangay had great legislative achievements too despite its wrangling and discord that constantly haunted the two factions.&nbsp; Learning from the lesson of seditious conspiracy earlier, the chairman on peace and order committee Hon. Perez sponsored ordinance called Tanod Ordinance of 2011.&nbsp; Objection from the opponent was timely even before the first reading.&nbsp; Subsequently readings went and objections were elevated by the council chairman to the sangguniang bayan; in the SB a hearing was done,&nbsp; and on September 2011 the SB cleared the ordinance from all objections they made.&nbsp; Today this ordinance is the handbook of conduct in the tanod brigade.&nbsp; KM-6 successfully passed two other important ordinances, the Barangay Site Plan Ordinance and the Heraldry Ordinance.&nbsp; The heraldry ordinance was co-sponsored by Hon. Ben Drazen Urgel and Hon. Cecilio Collen S. Perez, backed by the KM-6, it defines and promulgates the Seal of Eastern the Motto and limitations for its use.</p><p>Today Brgy. Eastern Poblacion is in introspection.&nbsp; It is seeking to understand and redefine its self toward becoming a better place for you and for me.</p><p>&nbsp;</p><p>RESIDENTS OR PERSONS HAILED IN THIS BARANGAY&nbsp;AND THEIR ACHIEVEMENT</p><p>Inocentes Villaflor&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Municipal Mayor</p><p>Altagracia Villaflor&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Municipal Mayor</p><p>Reynaldo Villaflores&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Municipal Mayor</p><p>Jose Villaflores&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Vice Mayor&nbsp;&nbsp;</p><p>Cipriano Urgel&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Bishop, Diocese of Palo</p><p>Caesar Garces&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Aux., Bishop, Zamboanga</p><p>Absalon Fulache&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Judge, Ormoc City</p><p>Emilio Ong&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - DepEd Division Superintendent</p><p>Lilia M. Sabando&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - DepEd Dist. Supervisor, Mun. Councilor</p><p>Velma Rio&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - DepEd Dist. Supervisor</p><p>Eva Fualche&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - CPA, Asst. RD COA VIII</p><p>Rev. Fr. Antonio Ong&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Diocese of Maasin</p><p>Rev. Fr. Roger Lumbre&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Diocese of Maasin</p><p>Rev. Fr. Celso Faller&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Diocese of Maasin</p><p>Rev. Fr. Melver Alfante&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Diocese of Maasin</p><p>Rev. Fr. Randy Saure&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Diocese of Maasin</p><p>Rosario Ong-Velos&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - CPA, Successful Banker</p><p>Conrado Fulache&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Mun. Councilor</p><p>Andres Rio&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Mun. Councilor</p><p>Cristuto Ong&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Mun. Councilor</p><p>Sofronio Perez&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Mun. Councilor</p><p>Giovanni Olo&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Mun. Councilor</p><p>Rebecca Barbusa&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - TOYM Awardee, Mun. Councilor</p><p>Rebecca Flores&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Mun. Councilor</p><p>Rogelio Yan&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - ABC President</p><p>Atty. Celso Flandez&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Clerk of Court, RTC Br 27</p><p>Rudolfo Fabular&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Mun. Councilor</p><p>Joseph Fulache&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Mun. Councilor</p><p>Engr. Franciso Ortega&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - District Engr., 3<sup>rd</sup> LEF DPWH</p><p>Engr. Rebecca Sabando&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Top #1 Chemical Engineering Licensure Exam</p><p>Engr. Dennis Alberto Perez&nbsp; - Top #3 Chemical Engineering Licensure Exam</p>"
    
}