{
    "content": "<p>In the year 1940&rsquo;s during the revelation time while this place was still a forest and has plenty of wild pigs.&nbsp; The cultivated barangay were located near the town of Hilongos, Leyte.</p><p>There was a man named &ldquo;Binoy&rdquo; Balvino Patron came from the province of Bohol.&nbsp; He reached this place to find a job and since he is a hunter, he stayed in this place.&nbsp; Years past, three hunters came they are also from Bohol namely: Esteban Sambayon, Guillermo Sambayon and Valentine Toco also found this place.</p><p>&nbsp;</p><p>One time Binoy decided to hunt, he group the hunters and agreed what date and time they will meet because they live distance from each other.&nbsp; And this place became their meeting place every time they wanted to hunt.&nbsp; They called their meeting place as &ldquo;Hampangan&rdquo; from the word Taboanan of Abotanan in Bisaya.</p><p>&nbsp;</p><p>Now, Hampangan is one of the progressive Barangay in the town of Hilongos, Leyte.&nbsp; As time passed many people came to live in this place.&nbsp; Most of them came from the province of Bohol during the Japanese Revelation time 1942-1946.&nbsp; There were only three(3) households who lived in this area, but it was lively especially every Saturday because this day was their market day or &ldquo;tabo&rdquo; in bisaya.</p><p>Hampangan became the center of all the neighboring barangays.&nbsp; Hampangan is one of the sitios of Brgy. San Isidro.&nbsp; This sitio has made an organization with only seven (7) members; they are&nbsp; Ambrocio Pagas, Jesus Moderondo, Fernanda Madis, Potenciana Monderondo, Felix Duarte, Norberto Baroto and Teofilo Villabeto.&nbsp; They called their organization as contribution.&nbsp; Later on, some members joined, Pablo Pagas, Eduardo Lampios, Felimon Toco, Francisco Vallentos, Emeliano Narido, Epefanio Lumbre, Procopio Agustin, Margarito Sambayon, Buenaventura Lascota and Sergio Madis.&nbsp; The organization had seventeen members.</p><p>Apolonio &ldquo;Nanong&rdquo; Rasonable, the husband of the brgy. captain of Brgy. San Isidro is always present during the &ldquo;tabo day&rdquo;.&nbsp; Nanong gaved another name of their organization which is Hampangan Tinabangay Club even though it was not officially registered.&nbsp; As the small organization was molded, they build a small chapel in the year 1964, Nanong&nbsp; donated a Saint Lady of Lourdes which became their patron until this time.</p><p>They usually sent their children to school in Barangay San Isidro but because of the long distance and danger of the river during the rainy season they decided to build the school which is annex to Brgy. San Isidro.&nbsp; The members of Hampangan Tinabangay Club agreed to make an activity called &ldquo;Bulhon&rdquo;.&nbsp; At first, there were only seventeen members headed by Epefanio Lumbre as a president, Francisco Vallentos as vice president and Godofreda Vallentos as a treasurer. They will sell their bulhon once a week.&nbsp; Within two years, 1974-1976, they were able to earn enough money to buy galvanized iron and nails for the school.&nbsp; They consulted the barangay captain of Brgy. San Isidro, Juanita Rasonabe about the school building, she was surprised and doubted, of they can build a school and said:&nbsp; &ldquo;I salute your aggressiveness and activeness if you can build a school&rdquo;.</p><p>Then Francisco Vallentos donated a land area for the school building the president of the organization together with their vice president and treasurer went to the municipal mayor, Juanito Gilos to ask the permission.&nbsp; The mayor agreed their plans and said &ldquo;you are the very hardworking&rdquo;.&nbsp; So they use their organization members to cut trees for lumber materials.&nbsp; Sergio Madis was assigned to cut and saw to make lumber because he knows better than the other members.&nbsp; Besides, he donated four (4) posts for the school building.&nbsp; When the lumber was ready they bought galvanized iron and nails and the organization members did the labor.&nbsp; The members dreamed not only the school but they also wanted that the Sitio will become a barangay.&nbsp;&nbsp; While the school building was still under construction, the people encourage joining the organization and they reach thirty three (33) members.</p><p>The president consulted one of his friends, Joaquin Valmera, who is an SB member and brought this problem to their session to help the Sitio Hampangan to become a barangay.&nbsp; Then Joaquin Valmera asked the census for five times, and they always do the request.&nbsp; The school was finished and was opened in the year 1978.&nbsp; The temporary road (lakdas) was there since 1972-1974 but it just only in Hampangan.</p><p>Due to the long process of asking the assigned teacher for the school the formal opening was made on Aug. 26, 1978 instead of June.&nbsp; Their teacher was Lita Cinco and it has only one level, Grade I.&nbsp; In that same year, because of the help of Mr. Valmera, they rejoiced in great happiness because DILG Jose Lakandula Viacroses together with barangay captain of Brgy. San Isidro visited and declared that the Sitio Hampangan will become a Barangay.</p><p>&nbsp;</p><p>After the declaration they appointed the Barangay captain Francisco Vallentos with his officials:</p><p>&nbsp;</p><ol><li>Epefanio Lumbre&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;5.&nbsp; Monico Villafa&ntilde;e</li><li>Francisco Lascota&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 6.&nbsp; Antonio Milano&nbsp;&nbsp; - Brgy. Secretary</li><li>Marcial Agustin&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;7.&nbsp; Calixta Toco&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; -&nbsp; Brgy. Treasurer</li><li>Marcelino Matas&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 8.&nbsp; Diomedes Milano-&nbsp; KB President</li></ol><p>From the year 1983-1984, the road widening happened with the participation of UNIC construction that is why the Barangay Hampangan is easy to reach in term of transportation until this time.&nbsp; There are motor cabs, trucks and canters that get the products of Barangay Hampangan.</p><p>Years past, the term of barangay officials was finished, the newly elected officials take over, and the barangay captain was Francisco Lascota with his officials:</p><ol><li>Epefanio Lumbre &ndash; the person contributed the great help of Brgy. Hampangan and still number one Kagawad</li><li>Jaime Lumbre &nbsp; Dominador Milano</li><li>Jorge Regaton &nbsp; Antonio Milano&nbsp; - Brgy. Secretary</li><li>Marciano Suaybaguio &nbsp; Melchor Soco&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; -&nbsp; Brgy. Treasurer</li><li>Hermano Cinto &nbsp; Margarita Lascota- KB President</li></ol><p>Mr. Epefanio Lumbre was still the leader of the organization Hampangan Tinabangay Club; the increasing population is one of a sign of progressive place that was once called &ldquo;tigumanan, tapokanan or tabo-anan&rdquo; of the hunters meeting place, now Barangay Hampangan.</p>"
}