{
    "content": "<p>Himo-aw is one of the many barangays in the municipality of Hilongos, province of&nbsp; Leyte.&nbsp;&nbsp; Himo-aw is a coastal area, its geographical location is unique indeed that its different to the other Barangay in Hilongos, is due to the fact that Himo-aw is a mass of land completely surrounded by bodies of water.&nbsp; If how unique the name and place itself, so much more of its history that is made rich by its tradition, cultures and beliefs.</p><p>Long ago, before anybody lived here, the place is a vast of nipa and mangrove land.&nbsp; Based on the disclosures of the old folks, the place is believed to be enchanted.&nbsp; Anyone who wonders into this place becomes bewitched.&nbsp; In the native tongue it states &ldquo;himo-on ug tiaw-tiaw&rdquo; o &ldquo;minoan&rdquo; that is where the term Himo-aw mysteriously and anonymously formulates, derived from the first two and last syllables.</p><p>The aborigine of Him-aw are from Bohol, the first family that took step here are the Macuto and Flores Clan during the Spanish era.&nbsp; The first Tenyente&nbsp; del Barrio is Lamberto Esmedina.</p><p>During the Japanese Regime, some prominent political figures find refuge in the barrio of Himo-aw.&nbsp; Former president of the Philippines Carlos P. Garcia, when he&rsquo;s still a senator, he hides from the Japanese at the thick thicket of mangroves at the far end of Himo-aw name &ldquo;taang-taang&rdquo; (still part of Himo-aw), Melquiades Flores a Municipal Mayor of Hilongos way back then also hide the same.&nbsp; So is with the former Congressman Veloso and also Assemblyman Emiliano Melgazo.</p><p>After the Philippine Independence, many leaders followed after first Tenyente del Barrio Lamberto Esmedina, and now we called it Punong Barangay, they are Mr. Segundino Villafa&ntilde;e, Mr. Pedro Modeste, Mr. Virgilio Sarino, Mr. Federico Barrera, Mr. Marcelino Bardos (ranked unrespectively) Mr. Uldarico Bohol, Mr. Ramon Melgazo, Mr. Nolasco S. Palomares and at present Hon. Virgilio F. Modeste.</p>"
}