{
    "content": "<p>Long time ago this village lying along the Salog River existed full of swamps and marshlands.&nbsp; In the north the land is ran by Canhinsay Creek wherein the excess water drained the areas and in the eastern portion is pounded by series of hills.</p><p>During those early days were few inhabitants that lived in the upper southern parts of the village because the remaining portions were swamps and marshes, thus, many people called the place &ldquo;kalamakan&rdquo;.&nbsp;&nbsp; The inhabitants engaged in planting, more especially rice.&nbsp; They also planted however, bananas, corn and rootcrops suited to the area.&nbsp; Many fish vendors coming from other barangays would pass through a narrow tracks and trails barefooted to the homes of the villagers to barter their fishes or shell-fishes with rice or bananas.</p><p>Almost every year many floods overflowed its river banks and as the water drained, it leaves the land with organic residues making the soil more fertile for crop production.</p><p>As the years passed by the inhabitants increased in number and the people organized this village into a barangay called this humble place &ldquo;Lamak&rdquo; the name taken after the word &ldquo;kalamakan&rdquo; meaning swamps and marshlands.</p><p>Presently, farming remains the main industry being engaged with by all people in the barangay.</p><p>Together with the development of other villages in to barangays, it is now bounded in the south by the salog river, in the east by Barangay Proteccion, Sta. Cruz and Bung-aw, in the north by Barangay Matapay, San Juan and Owak.</p><p>The Barangay is quite accessible to any means of land transportation and very near to wharf for sea travel as well as to the airport whenever a private plane travel is necessary.&nbsp; Being only about half a kilometer from the Poblacion of Hilongos it is also very accessible to different means of communications:&nbsp; post office, telegrams and telegraph offices and military radios.</p><p>It also has a central school for elementary education, some post harvest facilities, electrical installation, and some other immediate services like rural health center, multi-purpose center, basketball court, feeding center and purok and waiting sheds among others.</p><p>Inspite of these progress, however, it remains as a developing barangay that needs assistance and services from government and private entities, directly or indirectly.</p>"
}