{
    "content": "<p>People who needs people as the line of a song goes&hellip;. haunts our reverie to remember things and events.&nbsp; And mind my dear readers, it&rsquo;s precisely nice and magnetizing to repeat things significance and values thus --- worthwhile amplifying through legend- laden yet based from facts and document&hellip;. &ldquo;hence history repeats itself!&rdquo;</p><p>Back from the olden days the term Liberty was out of the picture.&nbsp; It never existed then.&nbsp; The story runs this way&hellip;</p><p>The place was formed through different sitios such as Cogon, Cabotungan, Cobcob and Tambaan.</p><p>In view of the fact that the place was so vast in area and the populace was so big, two mother barangays was created.&nbsp; Barangay Proteccion and Barangay Tejero.&nbsp; More or less it has a total area of 446,0289 hectares, geographically located in a vast plain much fitted for rice land rather than any other crops although producing also some other forms of livelihood vast of the populace survives on farming.&nbsp; Population statistics recorded lately that out of 505 households the barangay got a population of 2,629 people.</p><p>Speaking of distance the barangay is less than a kilometer from the town proper right upon the entrance of the place it takes 4 kilometers to the boundary of another barangay.</p><p>After the second World War -&nbsp; which was then the liberation time, the late Assemblyman Emeliano Melgazo, change the original name Lon-ob to Liberty which evidently mean freedom.&nbsp; Free from mother barangays Proteccion and Tejero- practically the sitios are named Purok Caimito for Cogon- Purok Nangka for Cabotungan- Purok Mangga for Sitio Cobcob.&nbsp; These three sitios; Cogon, Cabotungan and Cobcob were the stronghold of Kapitan Kikoy Flordelis during the Spanish regime.</p><p>Once in the past and moments after moments, Hilongos Airport is still situated at Sitio Tambaan now Purok Palay.</p><p>As one hero said:&nbsp; Give me Freedom! Or I shall die! - --- that&rsquo;s Liberty! Barangay Libery in the making.</p><p>Long time ago, the name Liberty was not yet founded.&nbsp; It was called by different names and divided into sitios such as cogon, cobcob, kabutongan and tamban.&nbsp; It composed of total land area of 446.19 hectares and characterized as plain barangay.&nbsp; It has a distance of one (1) kilometer from the Poblacion to the entrance of the barangay and occupies five (5) kilometer of the provincial road from the entrance to the boundary of another barangay and mostly is an agricultural land.</p><p>After the second world in 1994 there were liberation, and from that time the people has their freedom.&nbsp; So, the late Hon. Emeliano Melgazo became the Municipal Mayor in 1948, and as a mayor, power vested upon him he declared that the four sitios will be formed into one barangay.&nbsp; This will be the named as Liberty which stands for freedom of the people.&nbsp; So by January 20, 1950 it was legally name Barangay Liberty and celebrated the fiesta day and change to every last Saturday of the month of January in honor of our patron Sr. Sto. Nino.</p>"
}