{
    "content": "<p>A long time ago that was in the year 1940&rsquo;s this certain barangay was still unoccupied.&nbsp; But later on as year passed by, a certain person or a woman named Bira from other place came to this area.&nbsp; She was the very first woman who occupied this place together with her family.&nbsp; After many years had passed, some people from other place came and live with her.&nbsp; And this little by little they developed this area.&nbsp; So at that time the people called this Brgy. as sitio&nbsp; ka Bira from her named.&nbsp; But as year passed by the household became bigger and bigger until they decided to change its name&nbsp; from Sitio ka Bira they changed into Sitio Datag at that became well known and its mother Barangay was Brgy. Baliw.&nbsp; After so many years, the household and the population of this sitio became big because many people came and lived here.&nbsp; Some came from Brgy. Baliw, others came from Bohol and Cebu.&nbsp; Because they were thickly populated, the officials conduct an assembly.&nbsp; During the meeting, the officials together with the members of the assembly decided to change this sitio into a barangay.&nbsp; So the constituents in this barangay asked permission from the barangay officials of Brgy. Baliw.&nbsp; The people wanted to be free.&nbsp; They wanted this sitio to be separated from its mother barangay.&nbsp; The officials passed a resolution.&nbsp; They wanted to stand alone without the support of the brgy. officials of Baliw.&nbsp; Because the resolution was approved by the brgy. officials so they have no more problem.&nbsp; So they brought the resolution to the town and forward to the office of the Municipal Mayor for approval.&nbsp; At that time the late Emeliano Melgazo was the former mayor.&nbsp; After the consultation of said resolution to the office of the mayor, the resolution was disapproved by Mayor Melgazo. The officials with the constituents were worried about the result.&nbsp; They were discontented, because the people really wanted to be separated, they needed a freedom and liberty no longer under the mother barangay which was Barangay Baliw.&nbsp; So with the unity of the officials and the community they passed another resolution to be approved by the Sangguniang Bayan&nbsp; and the Municipal Mayor.&nbsp; The mayor approved the resolution of the brgy. officials from a sitio to a barrio and that was in the year 1950.&nbsp; The documents whom they wished to be approved really happened.&nbsp; All the dreams they had were realized and they knew that they can improve and develop their barrio with their own struggle.&nbsp; That was the late Melquiades Flores who approved the sitio to be a barangay.&nbsp; After he became and elected as a Municipal Mayor in the year 19___. &nbsp;&nbsp;&nbsp;&nbsp;So &nbsp;all &nbsp;&nbsp;the &nbsp;people owe &nbsp;&nbsp;a &nbsp;&nbsp;lot &nbsp;from &nbsp;the &nbsp;late &nbsp;Mayor &nbsp;Melquiades &nbsp;Flores.</p><p>The leader and the community were successful for the second time and they no ______ failure.&nbsp; Because of liberty and freedom, the barrio was named Barrio Libertad and now Brgy. Libertad.&nbsp; And the Brgy. site was 1.5hectare. all Barrrio Teniente or Brgy. Captain who spearheaded this Brgy. were all active and energetic.&nbsp; There were so many improvements, many projects in this brgy. in 1963 Mr. Olympio Buniol became one of the Brgy. Captain who made many improvement.&nbsp; Then he was succeeded by Mr. Primitivo Aus another active and energetic Brgy. Captain who made this barangay progressive. Then, in the year 1980 Mr. Olympio Buniol became a Brgy. Captain for the second time.&nbsp; During his leadership he was given a big and very important project that was the school building for the Elementary grade.&nbsp; The said school building was constructed last August 1980.&nbsp; After former Mayor Dodong Melgazo was elected as a Municipal Mayor in Hilongos and at that time the district supervisor was the late Nolasco Lelis.</p>"
}