{
    "content": "<p>Long time ago, there was a thick forest in where at the center was erected a big tree called &ldquo;tapay-tapay tree&rdquo;.&nbsp; It was then called tapay-tapay tree because the leaves of this tree looked like the web of the spider.&nbsp; The residents and the neighboring barangays who held their market days were shaded by the tree.</p><p>During the Spanish regime&nbsp; the place was called Barangay Matapay, named after the big tapay-tapay tree.&nbsp; The original settlers in the place where the Talisaynons, residents from Talisay, Cebu tenants Marcelo &ldquo;Eloy&rdquo; Villejo was the first tenants del barrio.</p><p>From the national highway near the salog river going to the northern part of Leyte , you can see the sign board of Brgy. Matapay, Hilongos, Leyte.&nbsp; At this junction, it is the crossing of the barangay, before you reach the barangay proper, you will walk about 1.3km to the west side you can pass by two bridge, the first is a single box culvert and the second is a double box culvert at about 10 meters long.</p><p>Barangay Matapay has a total land area of 57.94 hectares and approximately almost of its total land area is devoted to coconut production and a small nipa palm; it is also surrounded by mangrove trees.</p><p>Residents of this barangay are Cebuano and a Roman Catholic in religion.&nbsp; The barangay has a good source of water and best known for its best fishing catching.</p><p>Barangay Matapay has one Public Elementary School Building with 11 teachers and 13 classrooms.</p><p><em>Religious Aspects:</em></p><ol><li>Existing Religions- (dominant) Roman Catholic;</li></ol><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; (minority) Baptist, Iglesia ni Cristo</p><ol><li>Patron Saint - Senior Sto. Ni&ntilde;o</li><li>Date of Fiesta - January 15</li></ol><p>&nbsp;</p><p><em>Socio-Economic Data:</em></p><ol><li>Total Population &ndash; 2,825</li><li>People&rsquo;s Livelihood &ndash; Fishing</li><li>Total Number of Professionals &ndash; 168</li><li>of OFWs &ndash; 51</li><li>Total Land Area &ndash; 57.94</li><li>Distance of Town Proper &ndash; 3.1 km</li></ol><p>Present Means of Transportation &ndash; Tricycle;&nbsp; Fare &ndash; Php 11.00</p>"
}