{
    "content": "<p>Everything has its beginning.&nbsp; For the barrio folks of Barangay Owak in the municipality of Hilongos a few of the remaining living old folks they have this to say.</p><p>With the coming of the first batch of Spanish Conquistadores who wandered from one barrio to another, the questions of communication gap was the most possible answer for misunderstanding among the Spanish and Native communicators.</p><p>The Barangay of Owak was easily the object of several visits.&nbsp; This barangay being along the coastal portion of the Camotes Sea was easily accessible by means of boats used by the Spaniards plying from coast to coast.&nbsp; On one occasion some Spanish soldiers found time to disembark from their boat and started to scour the land area of the place.&nbsp; They followed the foot trails used by the natives in going from one place to another.&nbsp; It was late in the afternoon when the sun was starting to set in the open horizon.</p><p>The native were in a hurry to go home for fear of being caught by the coming darkness.&nbsp;&nbsp; The sky was darkening by a thick flock of black birds who were nearing to roost among the trees and coconut palms which abound in the barrio.&nbsp; Accidentally, a group of Spanish soldiers and a few native met in one of the intersection of network of foot trails.&nbsp; All of them look heavenward with inquiring eyes as to the appearances of the phenomenon that almost blocked the sight of the sky with sign language the Spanish soldiers through their spokesman approached the natives and in friendly gestures tried to extract an answer as to the name of the thick block flock birds in the sky.&nbsp; After so many signs manipulation, the natives understood what they wanted to know.</p><p>The answer to the question was the name Owak.&nbsp; When the Spanish invaders started to organize their revolutionary government many places of the town were assigned political names and one of these places was given the name of Barrio Owak.</p>"
}