{
    "content": "<p>This Barangay lies in the northeastern part of the municipality of Hilongos.&nbsp; It is surrounded by the following barangays, Proteccion, Bung-aw, Sto. Ni&ntilde;o and Concepcion.</p><p>The early settlers of this barangays were migrants from the southern islands; Bohol, Mindanao and Cebu.&nbsp; This early settlers originally made their temporary homes on the northern portion of this barangays particularly in the nearer portion of the farm, forested and hilly areas, the original barrio settlers by early Visayas settlers.</p><p>The early Paanons engaged chiefly in farming and river fishing.&nbsp; They supplemented their daily needs with rice, wild fruits and rootcrops.</p><p>After the conquest of Cebu by the Spanish Augustinians&nbsp; and Franciscans missionaries arrives in Hilongos, the first exploring parties came to this place.&nbsp; Asked by the Spaniards about the name of this Barangay (in Spanish) some native said &ldquo;this barangay is surrounded by a river which considered an island and everytime we crossed the river, the water is up to the &ldquo;thigh&rdquo; and they replied &ldquo;Pa-a&rdquo;.&nbsp; The name Pa-a was recorded in the Spanish achievers, hence it remains to this day the official name of the Barangay.</p><p>Roads before are fedders roads, are muddy because no gravel surfaces.</p><p>Vehicles only horses, cows and carabaos with &ldquo;balsa&rdquo; are means of transportation.</p><p><em><u>Building and infra facilities</u></em></p><p>The house of the teniente del barrio also serves as the Barangay Hall and Session Hall. Most of the barrio folks held their meeting at the kapilya or Barangay Chapel and its made of light materials like bamboo and the roof is &ldquo;sulirap&rdquo; or coconut leaves and cogon.</p><p>The bridges are made of two bamboos.&nbsp; Body weight balancing is very important in crossing the bridges.&nbsp; Cargoes brought by an animal has another way of passing.</p><p><em><u>The People</u></em></p><p>Population before, more or less 20 households with not less than 10 members in the family because no family planning introduced before.</p><p>They originated at sitio Banat-e now purok 7 because the people want to live and stay at a higher area or place where they are free or safe when floods came cause this Barangay is like an island, it is surrounded by river.</p><p>Some man from neighboring Barangay like Brgy. Proteccion migrates in Brgy. Pa-a to marriage. They like to live here because of big area of ricefields, cornlands and coconut land to work with and abundant production.</p><p>The occupation of the people mostly are farming.&nbsp; They sued barter system in their trading.</p><p>&nbsp;</p><p><em><u>Calamities and Destructions</u></em></p><p>Floods, typhoons and pests destructs lives, houses, animals and plants.</p><p>&nbsp;</p><p><em><u>Plants, Abaca change to Coconut Trees</u></em></p><p>Corn change to rice due to proper water management by making earth dam and mini-irrigation.&nbsp; More production due to high technology in agriculture.</p>"
}