{
    "content": "<p>Sa unang panahon dinhi sa atong Barangay duna may mga tawo&nbsp; nga nanginabuhi ug nagpuyo.&nbsp; Kini guibana-bana nga naghitabo bisan wala pa dinhi ang mga Kastila ug mga Espanyol.&nbsp; Apan kining mga tawhana gitawag ug mga lumad o mga retibo kining mga tawhana wala pay igong kahibalo.&nbsp; Ang ilang kahibalo limitado lamang diha sa panguma o pananum sa mga duma or (root crops), humay, mais, saging, ug uban pangpanginabuhi sama sa pagpangayam, pangisda ug uban pang kabuhayan.</p><p>Ang atong Barangay nahimutang sa 7 kilometros north of Hilongos Poblacion, Hilongos, Leyte.&nbsp; Ang mga kanait o kasikbit mao kining mosunod, sa norte-Brgy. Bung-aw, sa south- Brgy. Liberty, sa east- Brgy. Paa ug sa west- Brgy. Bagong Lipunan.&nbsp; Dunay duha ka salog ang Tagbante ug Tagbawto River nga nausa na lamang ka Salog River.&nbsp; Sa una gibahin kini sa mga sitios ug sa karon gibahin kini sa mga purok.&nbsp; Adunay pito (7) ka mga purok ug adunay karsada o dalan gikan sa lungsod or town proper.&nbsp; Dunay dalan nga nginganlan ug Barangay roads nga moabot ug 3 ka kilometro.&nbsp; Dunay Barangay Hall, Day Care Center, Stage and Covered Court, ug Health Center.</p><p>Sumala sa asoy sa mga katingulanang ang mga namunuan niining Barangay o Baryo kining mosunod dili klaro kon unsa o kanus-ang tuiga.&nbsp; Tenyente del Baryo Esyong Lora (Japanese Time), Pinoy Valmera, Emil Maga, Lauriano Lor, Perfecto Lora, Josefina Zamora ug Sefronio Fabular, Antonio Saludes, Margarito Maga (OIC) Eti Villherhermosa (OIC) Capt. Concordio Lor and at present Hon. Victoriano Malayan.</p><p>Sa tuig 1982 o kulang miabot ang linya sa kuryente dinhi sa Barangay ug nagsugod lamang sa 25 ka tawo o panimalay ang nagpa-estalar ug karon halos tanan nang kabalayan aduna nay kuryente.</p><p>Sa tuig 1960 kapin o kulang ang bag-ong kapilya nabolhin dool na sa eskwelahan nga giamot-amotan sa mga taga baryo.&nbsp; Sa laing bahin ang baryo nakabaton na ug bag-ong eskwelahan 2 rooms nga Gabaldon Type Building.&nbsp; Sa tuig 1952 nga gitukod sa 1 ka ektarya nga lote nga karon dool sa covered court.</p>p>Sa dili klarong tuig nakabaton ug Patrona ang baryo nga Senyora del Carmen nga kini nakita sa baryo nga eskapolaryo sitios nga daplin sa Salog River ug kini nasabut nga Virgin del Carmen ang nagsul-ob niini.&nbsp; Ug ang kasaulogan ika petsa 16 sa Hulyo matag tuig.&nbsp; Ang ngalan Proteccion naggikan sa pulong nga protect mean panalipod, Barangay Panalipod.&nbsp; Sa panahon sa gubat sa Hapon-Filipino-Amerikano nadungog nga dinhi nagtago si kanhi Pres. Carlos P. Garcia ug niadtong panahona Bese Presidente si Elpedio Quirino dinhi sa Barangay Panalipod dad-a ni Emiliano Melgazo nga niadtong panahona Alkalde sa Lungsod o Mayor.&nbsp; Niadtong panahona si Lauriano Zamora maoy Tenyente del Baryo nga suod kaayo ni Emeliano Melgazo.&nbsp; Gikan niadto nauso na ang pagtawag ug Barangay Panalipod o Barangay Proteccion.&nbsp; Ug hangtud karon mao na ang official pangalan sa atong Barangay, BARANGAY PROTECCION.</p>"
}