{
    "content": "<p>Ana sa sugilanon sa wala pa matukod ang Barangay San Antonio, may usa ka layas nga taga Bohol nga nagpuyo ning bukira.&nbsp; Ang iyang pangalan mao si Agnel Sukatre unya kadtong&nbsp; tawhana parente diay sa mga Delos Santos, unya ang ubang mga tawo nagpuyo pa gikan sa Brgy. Marangog ug mitukad sa bukid ug nagtikad sa maong yuta.&nbsp; Sa dihang miabot ang mga katuigan ang mga tawo nagkasinabot sila nga magtukod ug barangay ug ang napili nga ngalan Barangay Hingatad kay anhi man mag abot ang mga tawo ug&nbsp; ang napili nga pangulo sa Barangay mao is Angel Sukatre ug&nbsp; ang pangalan sa Barangay Hingatad, kay ang mga tawo sa una sobra ka mainampuon, ug daghang mga milagro nga mitungha.&nbsp; Ang mga milagro nga nagpaila sa maga tawo mao ang Birhen ug Jesus Nazarino ug mao ang Dios Amahan, Sr. San Jose ug San Antonio.&nbsp; Ang napili sa pangalan sa Brgy. Hingatad nga Patron si&nbsp; Sr. San Antonio, ilang gitukod niadtong tuig 1912 ang maong barangay ug ang kina unhang kapitan si Angel Sukatre ug nagpadayon ang mga tawo pagtikad sa maong yuta.&nbsp; Malipayon sila niadtong panahona, pag-abot sa tuig 1920 nag-ilis sila ug bag-ong pangulo sa barangay mao si Miguel delos Santos ang ikaduhang pangulo gikan pagtukod sa barangay ug mao gihapon ang mga tawo malipayon silang nagpuyo niadtong mga panahona.&nbsp; Ug milabay na usab ang daghang katuigan ug miabot ang tuig 1940 nag-ilis napod sila ug bag-ong pangulo ug ikatulong pangulo na kini nga mao si Victoriano Perido sa gihapon malipayon ang mga tawo nga nagpuyo nga walay pag-usab ug nagpatigayon ang ilang tagsatagsa nga panginabuhi.&nbsp; Ug milabay na usab ang laing katuigan, sa tuig 1960 hangtod sa tuig 1970 ang nangulo sa maong barangay mao si Dionesio O. Loquias ug nagpuyo sila nga malinawon.&nbsp; Ug miabot ang tuig 1975 si Alfredo Gomez nahimong pangulo sa Barangay Hingatad sa iyang pagdumala sa mga tawo, sa sinugdan maayo pa ang mga tawo wala pa kini magkagubot.&nbsp; Sa tuig 1979 ning abot ang dako nilang problema kay ming abot man ang dakong pundok sa mga NPA ug nagkakusog ang rebolotion kalihukan ug ang organisasyon sa mga tawo. Sa tuig 1983 mingkusog ang rebulotion sa bukid daghan napod ang organisasyon nga gitukod.&nbsp; Sa tuig 1985 nagsubo ang mga katawhan kay gipangpatay ang 37 ka katawhan sa mga NPA, daghang tawo ang nawagtangan ug kinabuhi gumikan sa operasyon linis matud pa sa labaw sa mga NPA. Ang mga sundalo military misaka sa bukid ug nanghasi ug nagpadayon gihapon ang Barangay Hingatad bisan pa man sa mga kagubot sa military tali sa mga NPA.&nbsp; Ug didto nagsugod na ang problema sa mga tawo ug sa ilang mga kaguol, kay gikan niadtong 1985 &nbsp;hangtud sa &nbsp;tuig 1992 &nbsp;nagkatibulaag naman ang mga tawo ug&nbsp; ang</p><p>uban nagtago-tago na sa kabukiran kay gigukod naman sila sa mga sundalo, padayon gihapon ang mga tawo sa pagtago-tago.&nbsp; Sa tuig 1992 is Dalmacio Nu&ntilde;ez maoy kapitan adtong panahona ug nagkakusog&nbsp; gihapon ang gubat sa barangay, ug nagkalisod na ang mga tawo didto sa&nbsp; kabukiran nga ilang gitaguan halos wala na silay makaon ug dili na gani &nbsp;sila maka dung-ag, panahon sa adlaw, hulaton nila nga moabot ang kagabhi-on kay lagi aron dili Makita sa sundalo ang aso aron sila makaluto ug dinung-ag sa kagabhi-on.&nbsp; Ug adtong panahona ang mayor mao si Altagracia Villaflor or &ldquo;Mami Gracing&rdquo; may malumo nga kasingkasing mitabang siya sa mga tawo sa Barangay sa Hingatad.&nbsp; December 24, 1992 gihatagan sa pagtagad ang mga tawo, ug gihatag kini sa mayora ug mibalik ang mga tawo ngadto sa sabakan sa balaod ug nag-iyahay na ang mga tawo ug pangita sa ilang mga kabuhian ngadto sa lungsod kay lagi gawasnon na sila ngadto sa lungsod sa Hilongos, Leyte.&nbsp; Sa tuig1994 gitugutan sa sa mayor nga pabalikon na ang mga tawo ngadto sa ilang Barangay San Antonio ug namalik gayod ang mga tawo ngadto sa ilang&nbsp; pinuy-anan nga malinawon.&nbsp; Ang pangalan sa maong barangay hingatad gi-ilisan sa patron nga Sr. San Antonio nga mao na karon ang pangalan sa maong barangay.&nbsp; Sa tuig 2005 si Dalmacio gihapon ang kapitan ug saw ala madugay mibalik napod ang kagubot sa Brgy. San Antonio kay pipila sa mga tawo nga mibalik pagtukod sa maong organisasyon sama sa KAMAS nga ang nagpaluyo mga rebelde, nagpasalamat ang mga tawo &nbsp;kay nabungkag ang KAMAS pinaagi sa 43<sup>rd</sup> Infantry Phil. Army&nbsp; ug padayon sa panginabuhi ang mga tawo nga wala nay kahasol sa ilang mga tagsa-tagsa ka hunahuna sa tuig 2010 ang nahimong Barangay captain mao si Vergilio Loquias us sa tabang sa labaw nga makagagahum, malinawon nga nagpuyo ang mga tawo dinhi sa Barangay San Antonio, Hilongos, Leyte, hangtod karong tuiga 2014.</p><p>Mao kini ang kinatibuk-ang history sa Barangay San Antonio, Hilongos, Leyte.</p>"
}