{
    "content": "<p>It was a century ago that is mountainous placed was launched.&nbsp; This was formerly called Brgy. Pulta, with a patron Saint Sta. Rita de Casia. &nbsp;At first there were only very few inhabitants, who unfortunately were not civilized.&nbsp; For many years, there people who were already dead, were headed by the certain Manuel Manicar.</p><p>During the time of Mr. Manuel Manicar, this Barangay celebrated their fiesta every 22<sup>nd</sup> of June.&nbsp; According to the old folks during this time, certain unpleasant incident usually happened especially when the people held a sinulog, in honor of their patron saint.&nbsp; They said, that people with knife and sharp bolos fought.&nbsp; Bloodshed, and those who suffered severe wounds did not survive, so death happened even on that day when people supposed to merry.</p><p>Many years passed, fortunately, the hatred felt by the people among each other before, seemed to have been gone with those years that have passed.&nbsp; The people then decided and agreed to change the name of this Barangay from Brgy. Pulta to Brgy. Sta. Margarita, after the name of the patron saint STA. RITA DE CASIA.&nbsp; They also agreed to change the date of their fiesta celebration from June 22 to May 22, which is the death anniversary of the said patron.&nbsp; During this time the people who were so devotee to their patron saint, were headed by the another person.</p><p>Before there was no school, so parents sent their children to neighboring Barangay through horses and carabaos, for at the time, there were no roads and vehicles. They also used their horses and carabaos to transport their products.</p><p>Year passed with the effort of some concerned individuals, a school was built by the year 1940.&nbsp; During this time, there were only four levels in the elementary which was offered and that was from Grade 1 to grade IV.&nbsp; Student population has increased, so by the years 1946, Grade V &amp; Grade VI were added.&nbsp; And because&nbsp; Brgy. STa. Margarita was blessed with people who were very cooperative and kind hearted, the school improvements did not with the elementary level only.&nbsp; By the year 1977 building for the secondary level were acquired and the school for the secondary level eventually, was opened.&nbsp; Not only that, because the place is a remote areas, by the year 1983, the government donated a Brgy. Health Center.</p><p>Presently, as we can see, Brgy., Sta., Margarita was really acquired a greater improvements.&nbsp; This progress made the people of this Barangay, popular even it they are living in a mountainous place.</p>"
}