{
    "content": "<p>Long time ago, before the Spaniards came our town, Hilongos, a group of people settled in a certain place was seven kilometers from the town proper.&nbsp; The settlers found out that the soil of the place was so rich, capable of growth and very fertile and they also said that the soil was very suited for agriculture.&nbsp; It is because the place was bounded or surrounded by a river, a lake and a brook that make the soil fertile.&nbsp; They called the place &ldquo;tabunok&rdquo; a visayan word for fertile soil.&nbsp; Many groups of settlers from other places migrated to the places for the reason that they want to discovered the place.&nbsp; They settlers planted the place with different kinds of plants.&nbsp; They built a warehouse wherein they stocked there bountiful harvest and they can used it for the future needs.&nbsp; They called it, &ldquo;kamalig&rdquo; which means a warehouse.&nbsp; Later on, the people called the place Kamalig or Sitio&nbsp; Kamalig.</p><p>One of the settlers name Pura move to the hilly side of the place.&nbsp; She and her family loved and developed the place.&nbsp; As time goes by, Pura became famous or popular in the hilly side of the place and later on, the resident in the hilly side called the place &ldquo;Kang Pura&rdquo; which became Kampura or Sitio Kampura.</p><p>The people of the place raised carabaos which they used it in the farm and for meat.&nbsp; Once they killed a carabao for meat, the only part that cannot be used was the horn so they just threw this anywhere.&nbsp; A brilliant resident invented or created new things out of the horns which thrown by the people.&nbsp; So the people admired what the person did and they also do these.&nbsp; Many visitors found out that the place has plenty of handles made from sungay (a visayas dialect of horn) and the household decoration was also made from sungay.&nbsp; So later on they called Magsungay or Magsingay.&nbsp; Today the folks called it Sitio Magsingay.</p><p>The place became barangay in the year.</p>"
}