{
    "content": "<p>Noong unang panahon, kining lugara nahisakop sa Barangay Tambis.&nbsp; Tungod kay sa maong Barangay anaay ilang gitawag ug teniente del barrio, aduna usab siyay mga konsehal.&nbsp; Tungod&nbsp; ang maong barangay daku ug halapad kaayo ang maong lugar ug lagyo usab ang mga kabalayan, kon maghimo sila ug mga&nbsp;&nbsp; meeting nga buntod sa barrio Tambis, atua mahimutang ang dakong batang nga kahoy nga gitawag ug &ldquo;bajong&rdquo; ila kining gibitay taliwala sa maong bungtod, aron kon unsay ilang kalihukan sa barrio sama sa meeting, samba o uban pa pakngon ug kusog aron madungog sa katawhan nga nanagpuyo niini.&nbsp;&nbsp;&nbsp;</p><p>Kini si Teodocio Pale sumala sa nahauna nga kini siya per merong konsehal, gihasolan siguro siya nga lagyo kaayo ang iyang kabalayan, mihangyo siya sa mayor sa lungsod nga mao si Melquiades Flores, nga naghatag siya ug pagtugot nga maghimo ug division sa Tambis.&nbsp; Mao nga agig pagtugot sa maong mayor, nagtukod siya&nbsp; ug&nbsp; iyang barangay.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p><p>Kini si Teodocio Pale siya usab ang unang teniente del barrio.&nbsp;&nbsp; Unya kini siya adunay kaila niining lugara nga ginganlan ug &ldquo;Kalaw&rdquo;, kini siya&nbsp;&nbsp; usa ka tawo nga mangangayam sa maong lugar tungod kay kining lugara lasang paman ug dagko pa ang kakahuyan ug daghan pa ang mga hayop nga nanagpuyo usa niini ang gitawag ug &ldquo;Osa&rdquo; sa eningles pa &ldquo;deer&rdquo;.&nbsp; Kining hayopa osara ang ilang sapa nga permanente nilang tunaan o kaligoanan, unya ang maong osa daghan pud ug mga anak&nbsp; o mga nate sa osa.&nbsp; Ang iyang makuha kasagaran mga anak sa nate sa osa ug anha ra pod ihawa sa maong sapa nga sakop ra pod niini, tungod kay sa unang panahon wala pay laing dako-dakong sapa niining lugara mao pod kana ang ilang gihimong tunaan sa mga nate sa osa mao nga sayon ra kaayo ang pag-ayam sa mga nate nga osa.</p><p>Mao nga si Teniente Teodocio Pale, ang iyang Barangay nga gitukod, iyang gihinganlan ang maong lugar ug Tagnate, kay ang makuha sa mangangayam kasagaran mga nate man mao nga gihinganlan na siya ug Barangay Tagnate, ug mao kana karon ang maong pangalan.</p><p>Natukod kini 1941 sa bulan sa Enero.</p><p>Mao kini ang lakbit saysay sa Barangay Tagnate. </p>"
}