{
    "content": "<p>Like the majority of the barangays and villages of the Philippines at present, Barangay Talisay was once a desolate and uninhabited woodland abundant with trees, bushes, and shrubs commonly found in tropical regions of the world.</p><p>Over the course of many centuries (most notably, during the Pleistocene Epoch), settlers from different tribes and ethnics of the Southeast Asian mainland slowly migrated to the islands of the Philippines.&nbsp; People of Malay descent, who now make up the majority of the population, are believed to have settled in the Philippines in waves of migration during the 3<sup>rd</sup> century BC.&nbsp; These early settlers established villages that were each ruled by a datu or chieftain.</p><p>During the arrival of the Spaniards, there were already political subdivisions including the Barangay.&nbsp; The Spaniards clustered the barangays and called pueblos.&nbsp; The increase in the population of these communities resulted to the institution of cities including Cebu City, the first established city of the Philippines.&nbsp; Continuous migration and resettlement brought inhabitants of Cebu to neighboring islands including the islands of Bohol and the western portion of Leyte.&nbsp; These Cebuanos eventually settled in these places and built their dwellings in the undergrowth of these islands.</p><p>Many years passed and the early settlers on the western part of Leyte dispersed, creating among themselves more villages and pueblos as their populations increased.&nbsp; One of the earliest instituted pueblos in the province of Leyte was Hilongos.</p><p>The people back then continued to migrate in search of territories they could live with which are rich in resources and free from subjugators that could compromise their freedom.&nbsp; Some&nbsp; residents of the larger pueblo of Hilongos ventured south and found themselves new dwellings in these areas.&nbsp; They eventually became the first inhabitants of the present- day Barangay Talisay.</p><p>According to the elders living in Barangay Talisay, the place had already been referred as such even before the revolution which led to the Philippines Independence of June, 1898.&nbsp; In an effort to decentralize leadership and effectively rule the archipelago, new Local Government Units were instituted by the Spaniards from existing villages in Hilongos. No one was really sure about how it came to be but locals say that Barangay Talisay was named so because a very large Talisay tree (Terminalia catappa) once stood at the side of the highway ad travelers usually tell the drivers of carriages to drop them at the &ldquo;Talisay&rdquo;.&nbsp; Local inhabitants became accustomed in calling the place &ldquo;Talisay&rdquo; until the name became associated with the general area.&nbsp; When government officials asked for the name of the place, it was agreed by the settlers to call their village &ldquo;Barrio Talisay&rdquo; and it became the official name of the place ever since.</p><p>Barangay &nbsp;Talisay previously had a very large land area and was even one of the largest in the municipality of Hilongos.&nbsp; It was bounded before by Barangay Tejero on the north, Barangay Campina on the northeast.&nbsp; Barangay Baas on the east, Barangay Tabunok on the southeast, Barangay Lunang on the south, Barangay Cantandog&nbsp; (not yet separated) on the west and southwest.&nbsp; The present Barangay Kanghaas and Barangay Mana-ul were both parts/sitios of Barangay Talisay until the then representative of the National Assembly, Hon. Emiliano Melgazo, suggested that these two should ideally be independent in order to receive more benefits from the National Government.&nbsp; The residents agreed and laws were passed making Barangay Kanghaas and Barangay Mana-ul component and independent barangays of the&nbsp; municipality of Hilongos.</p><p>According to the latest census conducted by the Barangay Civil Registrar, Brgy. Talisay has an estimated population of 1500 from 340 households.&nbsp; It is currently bounded by Brgy. Mana-ul&nbsp; on the north, Brgy. Campinaon the northeast, Brgy. Kanghaas on the east and southeast, Brgy. Lunang on the south, Brgy. Cantnadog I on the west and southwest, and Brgy. San Roque on the northwest.</p>"
}