{
    "content": "<p>Kaniadtong panahuna kining lugara sa wala pa mahimong barrio, napuno pa sa mga kakahuyan ug may tulo ka tubig nga nag-agi naglatas paingon sa dakong tubig nga mao ang salog.&nbsp; Ang unang tubig nga nag-agi may tawo didto dapit nagpuyo nga ginganlan ug Gorgot ug mao kining sapaa gipanganlan ug sapa sa Gorgota, ug ang ikaduhang tubig naglatas may kahoy nga prutas nagturok sa daplin nga gitawag ug Tambis &nbsp;ug ang ikatulong tubig nga nag-agi may tawo didto gihapon nagpuyo nga ginganlan ug Hebon ug mao kining sapaa gitawag ug sapa sa Hebonlod.</p><p>Ug sa panahon sa gubat may pipila nga mga tawo nga nagpuyo niining lugara ug didto sila nag-alagad o nagpasakop sa Bag-ong Lungsod o Concepcion na karon. Human milabay ang gubat nagkadaghan na ang mipuyo niining lugara ug aduna na silay napili isip&nbsp; pangulo ug ang tanan lumolupyo nagkasinabot nga mobulag na sa Bag-ong Lungsod o Concepcion kay gusto nila maghimo ug laing barrio ug ang ilang himoon panganlan nila ug barrio Tambis kinuha nila sa pangalan sa kahoy nga nagturok sa daplin sa sapa nga mao ang prutas nga Tambis ug mao kini lugara gitawag na nila ug Barrio Tambis.</p><p>Ug niini nakabaton na sila ug kaugalingon pangulo ug&nbsp; ang ilang pangulo nagaawhag sa iyang mga kauban nga maghimo ug tinuig nga selebrasyon or pagpangadye diin didto sila maghimo ug gamay nga payag-payag duol sa balay sa ilang napili nga pangulo niining barrioha aron himoon ang ilang hiniusang pag-ampo o pagpangadye ug ang unang pangulo niini nga barrio mao si Doroteo Pedere ug ang iyang luyo-luyo mao si Necholas Masendo.&nbsp; Pag-abot sa mga katuigan ilang nahunahunaan nga mog-naon ang pagtukod ug permanente nga kapilya alang sa ilang kasaulogan sa matag tuig ug kini ilang gitarok kampi sapa nga ginganlan ug Tambis, ug ang gitarokan niining yutaa gi donate ni Nicholas Masendo.</p><p>Pagkatapos ni Doroteo Pedere ang napuli nga pangulo mao si Guerico Lina tungod sa iyang dakong paningkamot sa paghangyo sa punoan sa lungsod nga kabutangan ug eskwelahan kini nga barrio ug siya mismo nag donate sa iyang yuta aron katukuran ug eskwelahan.&nbsp; Pagkatapos sa pag serbisyo ni Querico Lina ang nagsunod.</p><p>Ang masunod kaniya mao si Marcelo Lina ug miabot ang piniliay sa kapitan ug ang napili mao si Rodulfo Tan, pagkatapos sa iyang termino nahasunod si Domingo Lamo, pagkatapos usab sa iyang termino ang napili mao si Gualberto Lina ug wala siya makaabot sa iyang termino kay nakalas man ang iyang kinabuhi ug ang na appoint nga ilis mao sa Roman Tapayan ug miabot napod ang laing piniliay, ug ang nahimong kapitan mao si Federico Pilapil sa tuig 1989 pagtapus sa iyang termino ang napuli nga kapitan mao si Adriano Ragas sa tuig 1994 ug siya nagapadayon sa ikaduhang termino kutob sa tuig 2002.&nbsp; Niining election tuig 2002, walay miatbang kang Adriano Ragas sa pagka kapitan&nbsp; ug mipadayon hangtud sa ikatulo ka termino tuig 2007 ug nahiabot ang piniliay sa Oktubre 29, 2007 ug&nbsp; ang nahimong kapitan mao si Atilano Lina ug&nbsp; December 11, 2007 ang una niyang paglingkod ug misunod na usab ang laing election niadtong 2009 sa Oktubre 27 ug si Atilano Lina gihapon ang midaug sa maong piniliay.&nbsp; Sa pagka 2013 nagpili na pud ug bag-o mga opisyales ning barangaya pagka kapitan ug mga kagawad ug kini nagmalampuson nga piniliay.&nbsp; Ug si Atilano Lina gihapon ang napili isip amahan sa barangay.</p>"
}