{
    "content": "<p>During the Spanish colonization. Missionaries organized efforts to. One of the efforts made.&nbsp; There was even the construction &nbsp;of the Hilongos here in the construction, and powers especially to son during nights.</p><p>But before the start of Hilongos the Spanish Jesuit mis shall the materials for roofing will be source of tiza, to be used in the roofing for the ordered to one of their Spanish peace officers to scout an area of a clay soil.&nbsp; The clay soild is a raw material for making tiza&rsquo; to be used for roofing.&nbsp; Most likely 3 houses made up from a tiza materials is an attractive, big and beautiful ones.&nbsp; So a big church like Hilongos Roman Catholic church needs tiza materials.</p><p>After a Spanish Officer, Captain Tejero acknowledged the order to scout an area of clay soil, he proceeds to survey the eastern portion of Hilongos.&nbsp; He found out that in the area a raw material for tiza making is available.&nbsp; After the plan of manufacturing tiza was being studies, Captain Tejero a Spanish officer stationed to this place to manage the tiza factory to be used for the roofing of the Hilongos Roman Catholic Church.&nbsp; The&nbsp; production of tiza went on until the number of tiza production was done by force labor, no amount were given to the laborer.&nbsp; The laborers were treated as slaves.&nbsp; In transportation the tiza finished product to the construction site was also another problem.&nbsp; So construction manager recruited so many slaves to generate a big labor force in transporting the tiza finished products.&nbsp; And some of the slaves who were not familiar to the place asked where shall we get the tiza product to be carried us? And the answer was&nbsp; ________, you get from Captain Tejero.&nbsp; And the other said from Tejero.</p><p>Omitting the word captain to shorten the answer, so from that the time on the place was called.</p><p>Tejero named after Captain Tejero and now&nbsp; becomes Barangay Tejero.</p>"
}