{
    "content": "<p>In the early days, this Barangay Tuguipa has rich fertile valleys and plains, rolling hills and vast forest along the hills sides and mountains.&nbsp; The Tuguipa brook which flows the Cawasan falls until new supply, the rice fields with water.&nbsp; In the narrow valley sugar cane was grown, corn and coconuts were grown all over the places.&nbsp; Rice was found in the eastern part.&nbsp; Farming was the main source of livelihood.</p><p>During those days few people inhabited the place.&nbsp; There was much supply of foods.&nbsp; Aside from coconuts, rice, corn and different crops were grown like coffee, cacao, root crops and many others.&nbsp; Tuguipa was known for its abundance of food so people of Matalom particularly from Elevado came and settle the place.&nbsp; They found the land capable so they engage in agriculture production.&nbsp; Some of them got married to the native of Bohol.&nbsp; Some of them from Camotes Island came to barter their fish with agriculture products.&nbsp; Knowing of fertile land and later established their permanent homes.</p><p>It was not known how and when Tuguipa became a Barangay.&nbsp; Even before the nineteenth century Tuguipa had already a government of their own.&nbsp; The people were ruled by a certain guinhaopan, barangay captain today.</p><p>After some years the turn guinhaopan.&nbsp; It was change into teniente del baryo.&nbsp; Time come, teniente del baryo or barrios was change into Barangay.&nbsp; They recently elected brgy. captain.</p><p>Looking back to the past years this Barangay was depressed Barangay.&nbsp; No roads, bridges, no infrastructure project, no government organization and no progress.&nbsp; But as the years went by, change.&nbsp; Progress was changed in deed.</p><p>Today with the construction of roads and bridges, infrastructure projects, school building installation of electricity with the aid from the municipality and province, Tuguipa has came to rise from a disadvantage to part growing community.</p><p>Nine kilometers from the progressive town of Hilongos in the peaceful Barangay of Tuguipa, situated in a plateau.&nbsp; This Barangay is often called &ldquo;Saudi Tuguipa because it is a likened to Saudi Arabia where no water, as one the basic necessity needed in like is very scarce during the summer season, people get water fromTabunok or other nearby Barangay, since the wells brooks ad river run by dry.</p><p>Since the fiesta of Tuguipa falls on May which is the hottest part of the year.</p>"
}